Revit 2027 API
ParameterTypeId.RgbRParam Property
 "Red value for RGB color spec. (for Use with XAML Data Template example)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RgbRParam { get; }
Public Shared ReadOnly Property RgbRParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RgbRParam {
	ForgeTypeId^ get ();
}
static member RgbRParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace